<?php
/* ===============================================================================
  メディア
=============================================================================== */

/*===================================
メディアサイズ
===================================*/
add_theme_support('post-thumbnails');
set_post_thumbnail_size(0, 0, true);
add_image_size('50-50', 50, 50, true);
add_image_size('100-100', 100, 100, true);
add_image_size('150-150', 150, 150, true);
add_image_size('200-200', 200, 200, true);
add_image_size('250-250', 250, 250, true);
add_image_size('300-300', 300, 300, true);
add_image_size('400-400', 400, 400, true);
add_image_size('500-500', 500, 500, true);
